Revit 2027 API
DocumentValidation Methods
The DocumentValidation type exposes the following members.
Methods
Name | Description
CanDeleteElement |  Indicates if an element can be deleted.
Top
See Also
Reference
DocumentValidation Class
Autodesk.Revit.DB Namespace